burning_airlines_server/app/views/flights/show.html.erb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."flight_id" = $1  [["flight_id", 28]]
---
          <!-- <% column%> -->
          <% @flight.reservations.each do |reservation| %>