burning_airlines_server/app/controllers/airplanes_controller.rb

SELECT "airplanes".* FROM "airplanes"
---
  def index
    @airplanes = Airplane.all

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def show
    @airplane = Airplane.find params[:id]

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
  def edit
    @airplane = Airplane.find params[:id]