burning_airlines_server/app/controllers/flights_controller.rb

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def show
    @flight = Flight.find params[:id]
    @columns = (1..@flight.airplane.columns).to_a

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
---
  def edit
    @flight = Flight.find params[:id]