burning_airlines_server/app/controllers/session_controller.rb

  def create
    user = User.find_by name: params[:name]
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Bob"], ["LIMIT", 1]]